# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     3
#     -> 1

from random import randint

N=int(input("Введите число элементов массива: "))
X= randint(0,10)
list_nums=[randint(0,10) for i in range (N)]

print (f"Массив: {list_nums}; Число: {X}; Кол-во повторений указанного числа: {list_nums.count(X)}")
